Revit 2027 API
BuiltInFailures.MassFailures.OpenGeometryOnly Property
 Mass contains only mesh geometry, which can't be used to compute Mass Floors, volume, or surface area.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId OpenGeometryOnly { get; }
Public Shared ReadOnly Property OpenGeometryOnly As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ OpenGeometryOnly {
	FailureDefinitionId^ get ();
}
static member OpenGeometryOnly : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MassFailures Class
Autodesk.Revit.DB Namespace